{
    "en": {
        "navbar": [
            "About", "Projects", "Skills", "Contact"
        ],
        "home": [
            "I am a", "Software", "Engineer"
        ],
        "about": {
            "title": "Who am I?",
            "texts": [
                "My name is Maxence Bonamy, I'm 20 and I've been passionate about programming since the age of 11.",
                "I'm currently studying at ESEO Angers, an engineering school specializing in electronics and IT.",
                "I decided to specialize in software and web development."
            ]
        },
        "projects": {
            "title": "My projects",
            "button": "More projets",
            "check": "See",
            "sand_box": {
                "title": "Sand Box",
                "description": "This project is a physics simulation software program in which you can place various elements, such as water, sand, fire, etc., in the same environment. These elements then evolve together according to the laws of physics."
            },
            "bde_eseo": {
                "title": "ESEO Student Union's Website",
                "description": "As head of communications at my school's Student Union, I was able to design our association's showcase site for 2022-2023, after having designed the campaign site for the previous year."
            },
            "asynconf": {
                "title": "Asynconf Tournament",
                "description": "At the annual Asynconf conference on programming, I created this website that allowed me to clinch the first place in the tournament."
            },
            "aled": {
                "title": "School Help Website",
                "description": "As a member of SEIO, my school's Junior Enterprise, I had the opportunity to carry out several projects for companies. This one in particular involved adding an algorithm to the website following a form to help students in difficulty."
            },
            "minecraft_survival": {
                "title": "Minecraft Survival",
                "description": "I'm passionate about video games, and love creating my own. This one is my very first complete game, heavily inspired by a famous game. It's clearly not perfect, but it means a lot to me."
            }
        },
        "skills": {
            "title": "My skills",
            "names": {
                "cpp": "C++",
                "php": "PHP",
                "typescript": "TypeScript",
                "tailwind": "Tailwind CSS",
                "react": "React",
                "git": "Git",
                "c": "C",
                "java": "Java",
                "python": "Python"
            },
            "descriptions": {
                "cpp": "A programming language I've been learning for over 3 years.\nIt's notoriously complex. In fact, it has enabled me to understand an enormous number of concepts and to know what's going on behind the lines of code.\nI use it above all for its famous speed of execution, which makes it my preferred choice for my physics simulation projects.\nI mainly use it to the SFML library for display management in particular.",
                "php": "A programming language used in web development, particularly on the back-end.\nIt's a server-side language that I use with SQL to perform database queries.\nWhenever possible, I prefer to use the Prisma ORM for SQL queries.",
                "typescript": "A programming language based on JavaScript, widely used in web development, particularly on the front-end.\nTypeScript improves code quality, developer productivity and reduces potential errors compared to JavaScript, which explains why I've been using this language for almost a year now.\nFor example, I used it to create this portfolio.",
                "tailwind": "CSS is a descriptive language used to style web pages, which are themselves described by HTML files.\nTailwind is a CSS library that allows you to write much less CSS, thus considerably improving productivity.\nI used it, for example, to create this portfolio.",
                "react": "A JavaScript library widely used in web development.\nFor my part, I now use it with the TypeScript language, and from two different frameworks depending on the use case: ViteJS or NextJS.\nI'm also currently learning to use ReactNative, a React-based framework for developing cross-platform mobile applications.",
                "git": "A version management system that I now use for every project.\nIn fact, it's used extensively by developers and has become indispensable in the field of programming.\nI use it with the GitHub project host, where you can find the source code of all my projects, like this portfolio.",
                "c": "A very old and very important programming language.\nIt can be used in many fields, but I personally use it in hardware, to program embedded systems, for example with an STM32 board.\nHowever, in my opinion, there are now other technologies much more suited to other fields, so I don't use this language for other types of project.",
                "java": "A programming language based on the object-oriented paradigm, which I like very much.\nIt is used in many fields and is best known for its portability. Indeed, it runs on a virtual machine, which can be installed on any operating system.\nI started using it to program plugins for the Minecraft game, and I'm now using it to program my own games using the LibGDX framework.",
                "python": "A programming language widely known for its simplicity and large community.\nIt's an interpreted language, meaning that, unlike a compiled language, it's executed directly without going through the compilation stage, which unfortunately has an impact on execution speed.\nFor my part, it was the first language I learned to use, and I still use it today, with the Tkinter, Pygame, Matplotlib, Numpy, and other libraries."
            }
        },
        "contact": {
            "title": "Contact me",
            "texts": [
                "Would you like to learn more about me?",
                "Do you have a project to carry out?",
                "Don't hesitate to contact me by e-mail or on other networks!"
            ]
        },
        "footer": {
            "build": "Build by Maxence Bonamy using Vite, React, TypeScript & Tailwind."
        }
    },
    "fr": {
        "navbar": [
            "À propos", "Projets", "Compétences", "Contact"
        ],
        "home": [
            "Je suis", "Ingénieur", "Software"
        ],
        "about": {
            "title": "Qui suis-je ?",
            "texts": [
                "Je m'appelle Maxence Bonamy, j'ai 20 ans et je suis passionné de programmation depuis l'âge de 11 ans.",
                "J'étudie actuellement à l'ESEO à Angers, une école d'ingénieur spécialisée en électronique et en informatique.",
                "J'ai décidé de me spécialiser en développement logiciel et web."
            ]
        },
        "projects": {
            "title": "Mes projets",
            "button": "Plus de projets",
            "check": "Voir",
            "sand_box": {
                "title": "Bac à sable",
                "description": "Ce projet est un logiciel de simulation physique dans lequel on peut y placer différents éléments, tels que de l'eau, du sable, du feu, etc. Ces éléments évoluent ensuite ensemble en suivant les lois de la physique."
            },
            "asynconf": {
                "title": "Tournoi Asynconf",
                "description": "Lors de la conférence annuelle Asynconf sur le thème de la programmation, j'ai réalisé ce site qui m'a permis de remporter la première place lors du tournoi."
            },
            "bde_eseo": {
                "title": "Site du BDE de l'ESEO",
                "description": "Ayant été responsable du pôle communication du BDE de mon école, j'ai pu réaliser le site vitrine de notre association pour l'année 2022-2023, après avoir fait celui de campagne l'année précédente."
            },
            "aled": {
                "title": "Site d'aide scolaire",
                "description": "Étant intervenant au SEIO, la Junior Entreprise de mon école, j'ai eu l'opportunité de réaliser plusieurs projets pour des entreprises. En particulier celui-ci qui consiste à ajouter un algorithme au site Internet en suite à un formulaire pour aider des étudiants en difficulté."
            },
            "minecraft_survival": {
                "title": "Minecraft Survival",
                "description": "Je suis passionné de jeux vidéo, et j'adore créer les miens. Celui-là est mon tout premier jeu complet, fortement inspiré d'un célèbre jeu. Il n'est clairement pas parfait, mais il a beaucoup d'importance à mes yeux."
            }
        },
        "skills": {
            "title": "Mes compétences",
            "names": {
                "cpp": "C++",
                "php": "PHP",
                "typescript": "TypeScript",
                "tailwind": "Tailwind CSS",
                "react": "React",
                "git": "Git",
                "c": "C",
                "java": "Java",
                "python": "Python"
            },
            "descriptions": {
                "cpp": "Un langage de programmation que je suis en train d'apprendre depuis plus de 3 ans.\nIl est connu pour être complexe. Il m'a en effet permis de comprendre énormément de concepts et de savoir ce qui se passe derrière les lignes de code.\nJe l'utilise surtout pour sa célèbre rapidité d'exécution, ce qui en fait mon choix de prédilection pour mes projets de simulation physique.\nJe l'utilise principalement avec la librairie SFML pour la gestion de l'affichage notamment.",
                "php": "Un langage de programmation utilisé dans le développement web, en particulier sur la partie back-end.\nC'est un langage côté serveur que j'utilise avec le langage SQL pour réaliser des requêtes vers des bases de données.\nDe mon côté, lorsque c'est possible, je préfère utiliser l'ORM Prisma pour réaliser les requêtes SQL.",
                "typescript": "Un langage de programmation qui s'appuie sur JavaScript, très utilisé dans le développement web, notamment sur la partie front-end.\nTypeScript améliore la qualité du code, la productivité des développeurs et réduit les erreurs potentielles par rapport à JavaScript, ce qui explique mon choix pour utiliser ce langage depuis bientôt un an.\nJ'ai par exemple utilisé ce langage pour réaliser ce portfolio.",
                "tailwind": "Le CSS est un langage descriptif qui permet de \"styliser\" des pages web, elles-mêmes décrites par des fichiers HTML.\nTailwind est une librairie CSS qui permet d'écrire beaucoup moins de CSS et ainsi d'améliorer considérablement la productivité.\nJe l'ai par exemple utilisée pour réaliser ce portfolio.",
                "react": "Une librairie JavaScript très utilisée dans le développement web.\nDe mon côté, je l'utilise maintenant avec le langage TypeScript, et à partir de deux frameworks différents selon les cas d'utilisation : ViteJS ou NextJS.\nJe suis également actuellement en train d'apprendre à me servir de ReactNative, un framework basé sur React qui permet de développer des applications mobiles multiplateformes.",
                "git": "Un système de gestion de versions que j'utilise maintenant pour chaque projet.\nEn effet, il est extrêmement utilisé par les développeurs et il est devenu indispensable dans le domaine de la programmation.\nJe l'utilise avec l'hébergeur de projets GitHub, sur lequel vous pouvez retrouver le code source de tous mes projets, comme ce portfolio.",
                "c": "Un langage de programmation très ancien et très important.\nIl peut être utilisé dans de nombreux domaines, mais je l'utilise personnellement en hardware, pour programmer des systèmes embarqués, par exemple avec une carte STM32.\nCependant, selon moi, il existe maintenant d'autres technologies beaucoup plus adaptées aux autres domaines, ce qui fait que je n'utilise pas ce langage pour d'autres types de projets.",
                "java": "Un langage de programmation qui repose sur le paradigme orienté objet, que j'apprécie très fortement.\nIl est utilisé dans de nombreux domaines et est surtout connu pour sa portabilité. En effet, il est exécuté sur une machine virtuelle, qui peut être installée sur tout système d'exploitation.\nJ'ai commencé à l'utiliser pour programmer des plugins sur le jeu Minecraft, et je l'utilise maintenant pour programmer mes propres jeux à l'aide du framework LibGDX.",
                "python": "Un langage de programmation très connu pour sa simplicité et sa grande communauté.\nC'est un langage interprété, c'est-à-dire, qu'à la différence d'un langage compilé, il est exécuté directement sans passer par l'étape de la compilation, ce qui a malheureusement un impact sur la rapidité d'exécution.\nDe mon côté, c'est le premier langage que j'ai appris à utiliser, et je l'utilise encore aujourd'hui avec notamment les librairies Tkinter, Pygame, Matplotlib, Numpy, etc."
            }
        },
        "contact": {
            "title": "Contactez-moi",
            "texts": [
                "Vous voulez en apprendre plus sur moi ?",
                "Vous avez un projet à réaliser ?",
                "N'hésitez pas à me contacter par e-mail ou sur d'autres réseaux !"
            ]
        },
        "footer": {
            "build": "Fait par Maxence Bonamy avec Vite, React, TypeScript & Tailwind."
        }
    }
}