{
    "en": {
        "navbar": [
            "About", "Projects", "Skills", "Contact"
        ],
        "home": [
            "I am a", "Software", "Engineer"
        ],
        "about": {
            "title": "Who am I?",
            "texts": [
                "My name is Maxence Bonamy, I'm 20 and I've been passionate about programming since the age of 11.",
                "I'm currently studying at ESEO in Angers, an engineering school specializing in electronics and IT.",
                "I decided to specialize in software and web development."
            ]
        },
        "projects": {
            "title": "My projects",
            "button": "More projets",
            "check": "See",
            "sand_box": {
                "title": "Sand Box",
                "description": "This project is a physics simulation software program in which you can place various elements, such as water, sand, fire, etc., in the same environment. These elements then evolve together according to the laws of physics."
            },
            "bde_eseo": {
                "title": "ESEO Student Union's Website",
                "description": "As head of communications at my school's Student Union, I was able to design our association's showcase site for 2022-2023, after having designed the campaign site for the previous year."
            },
            "aled": {
                "title": "School Help Website",
                "description": "As a member of SEIO, my school's Junior Entreprise, I had the opportunity to carry out several projects for companies. This one in particular involved adding an algorithm to the website following a form to help students in difficulty."
            },
            "minecraft_survival": {
                "title": "Minecraft Survival",
                "description": "I'm passionate about video games, and love creating my own. This one is my very first complete game, heavily inspired by a famous game. It's clearly not perfect, but it means a lot to me."
            }
        },
        "skills": {
            "title": "My skills",
            "names": {
                "cpp": "C++",
                "php": "PHP",
                "typescript": "TypeScript",
                "tailwind": "Tailwind CSS",
                "react": "React",
                "git": "Git",
                "c": "C",
                "java": "Java",
                "python": "Python"
            },
            "descriptions": {
                "cpp": "",
                "php": "",
                "typescript": "",
                "tailwind": "",
                "react": "",
                "git": "",
                "c": "",
                "java": "",
                "python": ""
            }
        },
        "contact": {
            "title": "Contact me",
            "texts": [
                "Would you like to learn more about me?",
                "Do you have a project to carry out?",
                "Don't hesitate to contact me by e-mail or on other networks!"
            ]
        }
    },
    "fr": {
        "navbar": [
            "À propos", "Projets", "Compétences", "Contact"
        ],
        "home": [
            "Je suis", "Ingénieur", "Software"
        ],
        "about": {
            "title": "Qui suis-je ?",
            "texts": [
                "Je m'appelle Maxence Bonamy, j'ai 20 ans et je suis passionné de programmation depuis l'âge de 11 ans.",
                "J'étudie actuellement à l'ESEO à Angers, une école d'ingénieur spécialisée en électronique et en informatique.",
                "J'ai décidé de me spécialiser en développement logiciel et web."
            ]
        },
        "projects": {
            "title": "Mes projets",
            "button": "Plus de projets",
            "check": "Voir",
            "sand_box": {
                "title": "Bac à sable",
                "description": "Ce projet est un logiciel de simulation physique dans lequel on peut y placer différents éléments, tels que de l'eau, du sable, du feu, etc. Ces éléments évoluent ensuite ensemble en suivant les lois de la physique."
            },
            "bde_eseo": {
                "title": "Site du BDE de l'ESEO",
                "description": "Ayant été responsable du pôle communication du BDE de mon école, j'ai pu réaliser le site vitrine de notre association pour l'année 2022-2023, après avoir fait celui de campagne l'année précédente."
            },
            "aled": {
                "title": "Site d'aide scolaire",
                "description": "Étant intervenant au SEIO, la Junior Entreprise de mon école, j'ai eu l'opportunité de réaliser plusieurs projets pour des entreprises. En particulier celui-ci qui consiste à ajouter un algorithme au site Internet en suite à un formulaire pour aider des étudiants en difficulté."
            },
            "minecraft_survival": {
                "title": "Minecraft Survival",
                "description": "Je suis passionné de jeux vidéos, et j'adore créer les miens. Celui-là est mon tout premier jeu complet, fortement inspiré d'un célèbre jeu. Il n'est clairement pas parfait mais il a beaucoup d'importance à mes yeux."
            }
        },
        "skills": {
            "title": "Mes compétences",
            "names": {
                "cpp": "C++",
                "php": "PHP",
                "typescript": "TypeScript",
                "tailwind": "Tailwind CSS",
                "react": "React",
                "git": "Git",
                "c": "C",
                "java": "Java",
                "python": "Python"
            },
            "descriptions": {
                "cpp": "",
                "php": "",
                "typescript": "",
                "tailwind": "",
                "react": "",
                "git": "",
                "c": "",
                "java": "",
                "python": ""
            }
        },
        "contact": {
            "title": "Contactez-moi",
            "texts": [
                "Vous voulez en apprendre plus sur moi ?",
                "Vous avez un projet à réaliser ?",
                "N'hésitez pas à me contacter par mail ou sur d'autres réseaux !"
            ]
        }
    }
}